# Learnimals Custom Vocabulary
# Project-specific terms that should be accepted

# Project Names
Learnimals

# Technology Terms
npm
ESLint
Vitest
Vite
PWA
nginx
Kubernetes
Kustomize
Gitleaks
Trivy
TruffleHog
Prettier
markdownlint
Vale
GitHub
GitLab
CI/CD
YAML
JSON
API
CSS
HTML
JavaScript
TypeScript
DOM
XSS
CSP
CORS
JWT
OAuth
SDK
CLI
UI
UX
WCAG
ARIA
SEO

# Development Terms
dev
staging
prod
config
configs
repo
repos
localhost
webhook
webhooks
middleware
frontend
backend
fullstack
codebase
codebases
async
webpack
rollup
esbuild
transpile
polyfill
bundler
minify
sourcemap
hotfix
bugfix

# Package Names
jsdom
idb
zustand
clsx
tailwindcss

# File Extensions
js
ts
jsx
tsx
css
scss
md
yml
yaml
json
html
htm
txt
sh
bash

# Commands and Tools
cd
ls
mkdir
rm
cp
mv
git
node
npx
pnpm
yarn
docker
kubectl
make
grep
sed
awk
curl
wget

# Project-Specific Terms
subjectName
characterName
heroSubtitle
themeRegistry
themeManager
themeSwitcher
SubjectTemplateLoader
BaseComponent
Modal
Card
Toast
TabManager
CharacterGallery
CharacterRenderer
CharacterCustomizationWizard

# Educational Terms
COPPA
gamification
scaffolding

# Testing Terms
vitest
jest
mocha
chai
cypress
playwright
puppeteer
testid
e2e
unit
integration

# CI/CD Terms
workflow
workflows
pipeline
pipelines
artifact
artifacts
runner
runners
linter
linters
formatter
formatters

# Documentation Terms
ADR
ADRs
README
CHANGELOG
CONTRIBUTING
LICENSE
TODO
FIXME
HACK
BUG
DEPRECATED
WIP

# Common Abbreviations
vs
etc
eg
ie
min
max
src
dist
tmp
lib
bin
pkg
env
arg
args
param
params
req
res
ctx
util
utils
fn
func
arr
obj
str
num
bool
int
val
vals
ref
refs
prop
props
attr
attrs
elem
elems
btn
btns
nav
img
imgs
msg
msgs
err
errs
info
warn
debug
log
logs

# Brand Names
Google
Microsoft
Mozilla
Apple
Chrome
Firefox
Safari
Edge
Opera
Android
iOS
Windows
macOS
Linux
Ubuntu
Alpine
Redis
MongoDB
PostgreSQL
MySQL
SQLite
AWS
GCP
Azure
Vercel
Netlify
Heroku
DigitalOcean
Cloudflare
Fastly
Akamai

# Emojis (common in our docs)
🎮
🐵
🦁
🐼
🦜
🦫
🦅
🐧
🦉
🐢
🐟
✨
🚀
🎨
🎯
📚
🔧
⚡
💡
🛡️
🔒
🔍
📱
💻
🌐
📦
🐛
🔥
✅
❌
⚠️
ℹ️
📝
📋
🏗️
🚧
🔨
🧪
🧩
🎭
🎪
🏆
🌟